# Python Pandas: Tratando e analisando dados
[link do curso](https://cursos.alura.com.br/course/introducao-python-pandas)

## 1 Import

In [1]:
import pandas as pd

## 2 Fonte de dados

In [7]:
dados = pd.read_csv('../dados/aluguel.csv', sep=';')
dados.head(2)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN

# Análise

# Aula

## 2 Importando dados

In [9]:
dados = pd.read_csv('../dados/aluguel.csv', sep=';')
dados.head(2)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN

### 2.4 Conhecendo a base de dados

Os tipos de dados

In [10]:
dados.dtypes

Tipo           object
Bairro         object
Quartos         int64
Vagas           int64
Suites          int64
Area            int64
Valor         float64
Condominio    float64
IPTU          float64
dtype: object

Criação de Data Frame e renomeação do *name* da coluna

In [14]:
tipo_dados = pd.DataFrame(data=dados.dtypes, columns=['tipo_dados'])
tipo_dados.columns.name='variavel'
tipo_dados

variavel   tipo_dados
Tipo           object
Bairro         object
Quartos         int64
Vagas           int64
Suites          int64
Area            int64
Valor         float64
Condominio    float64
IPTU          float64

Retorna os númeors de linhas e colunas

In [15]:
dados.shape

(32960, 9)

In [17]:
print(f"A base de dados apresenta {dados.shape[0]} linhas e {dados.shape[1]} colunas ou variáveis")

A base de dados apresenta 32960 linhas e 9 colunas ou variáveis

### 2.7 Importando outras fontes

Leitura de dados json

In [20]:
df_json = pd.read_json('../dados/aluguel.json')
df_json.head(2)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000,NaN,NaN

Leitura de dados txt

In [26]:
df_txt = pd.read_table('../dados/aluguel.txt')
df_txt.head(2)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000,NaN,NaN

Leitura de arquivo do excel

In [3]:
df_xlsx = pd.read_excel('../dados/aluguel.xlsx')
df_xlsx.head(2)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000,NaN,NaN

Leitura de página html

In [2]:
df_html = pd.read_html('../dados/dados_html_1.html')
df_html[0]

  FAIXA ETÁRIA UNAFISCO SAÚDE SOFT II SOFT PARTICIPATIVO      UNIQUE
0      00 A 18               R$218,99           R$192,60    R$334,48
1      19 A 23               R$263,63           R$207,67    R$380,06
2      24 A 28               R$322,44           R$224,26    R$464,39
3      29 A 33               R$402,05           R$258,63    R$566,68
4      34 A 38               R$455,17           R$306,37    R$664,61
5      39 A 43               R$489,29           R$417,93    R$742,72
6      44 A 48               R$582,65           R$495,24    R$869,47
7      49 A 53               R$718,86           R$562,64  R$1.046,29
8      54 A 58               R$908,54           R$721,00  R$1.355,74
9   59 OU MAIS             R$1.244,50         R$1.151,62  R$2.003,53

In [4]:
df_html = pd.read_html('https://www.federalreserve.gov/releases/h3/current/default.htm')

len(df_html)

3

In [25]:
## 3 Series e Index

In [ ]:
## 4 Filtrando dados

In [ ]:
## 5 Frequências de imóveis

In [ ]:
## 6 Tratando de dados faltantes

In [ ]:
## 7 Novas variáveis

In [ ]:
## 8 Estatísticas descritivas

In [ ]:
## 9 Removendo Outliers